/**
 * –азработать консольную программу, выполн€ющую вывод треугольников в пор€дке убывани€ их площади. 
 * ѕосле добавлени€ каждого нового треугольника программа спрашивает, 
 * хочет ли пользователь добавить ещЄ один. 
 * ≈сли пользователь ответит УyФ или УyesФ (без учЄта регистра), 
 * программа попросит ввести данные дл€ ещЄ одного треугольника, 
 * в противном случае Ц выводит результат в консоль.
 *
 *Х   –асчЄт площади треугольника должен производитс€ по формуле √ерона.
 *Х    аждый треугольник определ€етс€ именем и длинами его сторон. 
 *‘ормат ввода (разделитель - зап€та€): 
 *<им€>, <длина стороны>, <длина стороны>, <длина стороны>
 *Х   ѕриложение должно обрабатывать ввод чисел с плавающей точкой.
 *Х   ¬вод должен быть нечувствителен к регистру, пробелам, табам.
 *Х   ¬ывод данных должен быть следующем примере:
 *============= Triangles list: ===============
 *1. [Triangle first]: 17.23 сm
 *2. [Triangle 22]: 13 cm
 *3. [Triangle 1]: 1.5 cm
 *
 */
/**
 * @author Leo
 *
 */
package com.softserve.edu.task3;